{
  "illandril-token-tooltips": {
    "setting": {
      "debug": {
        "label": "Debug Mode",
        "hint": "Leave this disabled unless specifically asked to enable it by Illandril (otherwise, it will slow things down)."
      },
      "menu": {
        "customOptions": {
          "name": "Tooltip Values",
          "label": "Configure Tooltip Values",
          "hint": "Customize which values are shown in the Tooltip. Custom Tooltip Values allow you to show tooltips for any numerical data associated with a token's actor.",

          "title": "Tooltip Values Configuration",

          "instructions": {
            "top": "For each Standard Tooltip Value, select the permission required to see those values (note: not all standard values show for all systems). For each Custom Tooltip Value, specify a Name, Icon, and Data Key.",
            "name": "A name for the data shown. If no icon is specified, the name will be displayed instead of an icon in the tooltip.",
            "icon": "The name of the Font Awesome icon to show in the tooltip. A preview of the icon is shown to the right of the input to help ensure you select the right icon. If left blank, the name will be shown instead of an icon. Note that not all Font Awesome icons are available (FoundryVTT itself is in control over which icons are available, not this module - this module is just using the icons that are shipped with FoundryVTT).",
            "iconLink": "Search for icons on the Font Awesome Website",
            "attributeKey": "The property key used to lookup the value you want to show in the tooltip. For example, to show the CR of a creature using the DnD5e system, specify `system.details.cr`. The Data Key Debugger can be enabled to assist in finding the correct Data Key for the information you want to display.\nYou can use +, -, * (multiply), / (divide), and % (modulo) to perform basic math (operations are applied left-to-right, NOT PEMDAS; e.g. `5+5*2` would be 20, not 15). You can also use <, >, <=, >=, != (not equal), or == (equal) to suppress a line if the specified condition is not met (e.g. `system.skills.perception.value != 0 + 10` will show a value 10 greater than the token's perception skill, but only if the token's perception skill is not zero). You can also use & to concatenate multiple values together, and \"quotes\" to specify fixed strings (e.g. `system.carryWeight.value & \" lbs\"` would show as `72 lbs`)",
            "permission": "The minimum permission a player must have to see this value in an actor's tooltip (assuming they can see the tooltip at all - see the Tooltip Visibility setting on the main settings page). Note: GMs are considered Owners for all actors.",
            "gmPermission": "This setting allows players to see their own details in the tooltip while hiding that information from GMs. Note: This checks if the token has a Player Owner, and not the character type, so an NPC character with a player owner counts as player info, and a PC character without a player owner counts as NPC info.",
            "showOnPersistent": "This setting allows details to show on the hover tooltips, but be hidden on the persistent tooltips. Note: The other permission settings must pass in addition to this setting being enabled for details to show on the persistent tooltips - data cannot be shown in the persistent tooltip but hidden in the hover tooltip.",
            "show": "Show Help",
            "hide": "Hide Help",
            "bugs": "Click here to report bugs or request features"
          },

          "header": {
            "name": "Name",
            "icon": "Icon",
            "attributeKey": "Data Key",
            "permission": "Permission to Show",
            "gmPermission": "GM sees\nPlayer info?",
            "showOnPersistent": "Show on\nPersistent?"
          },

          "standardOptionsTitle": "Standard Tooltip Values (may not show in all systems)",
          "customOptionsTitle": "Custom Tooltip Values",

          "standard": {
            "hp.name": "Health",
            "hp.key": "Varies (ex. system.attributes.hp)",

            "ac.name": "Armor Class",
            "ac.key": "Varies (e.g. `system.attributes.ac`)",

            "movement.name": "Movement",
            "movement.key": "Varies (e.g. `system.stats.speed`)",

            "ruler.name": "Distance Ruler",
            "ruler.key": "Calculated distance from the selected token",

            "attributesPlus.name": "Attribs (+Mod)",
            "attributesPlus.help": "Attributes and associated Modifiers (including Attribute-based Saves for appropriate systems).",
            "attributesPlus.icon": "label",
            "attributesPlus.key": "Varies (e.g. `system.abilities.str`)",

            "passives.name": "Passive Skills",
            "passives.key": "Varies (e.g. `system.skills.prc.passive`)",

            "resources.name": "Resources",
            "resources.key": "system.resources.#",

            "savingThrows.name": "Saving Throws",
            "savingThrows.help": "Fortitude, Reflex, and Will Saving Throws (Pathfinder and D&D 3.5). Does not include Attribute-based saving throws (D&D 5).",
            "savingThrows.icon": "label",
            "savingThrows.key": "Varies (e.g. `system.saves.will`)",

            "dmgResVuln.name": "Dmg Res./Vuln.",
            "dmgResVuln.help": "Damage Resistances, Immunities, and Vulnerabilities/Weaknesses. Note: for systems that mix Damage and Condition Immunities (ex. PF2e), Condition Immunities are included with Damage Immunities.",
            "dmgResVuln.icon": "label",
            "dmgResVuln.key": "Varies (e.g. `system.traits.di/dr/dv`)",

            "condImm.name": "Cond. Imm.",
            "condImm.help": "Condition Immunities. Note: for systems that mix Damage and Condition Immunities (ex. PF2e), Condition Immunities are included with Damage Immunities.",
            "condImm.icon": "label",
            "condImm.key": "Varies (e.g. `system.traits.ci`)",

            "spells.name": "Spell Slots",
            "spells.key": "Varies (ex. `system.spells.spell#`)",

            "talents.name": "Talents",
            "talents.icon": "the Talent's image",
            "talents.key": "system.talentList.#.name",

            "items.name": "Item Uses",
            "items.icon": "the Item's image",
            "items.key": "DnD5e only (toggle per item in actor sheets)"
          },

          "moveDown": "Move Down",
          "moveUp": "Move Up",
          "delete": "Delete",
          "deleteConfirm": "Are you sure you want to delete this value?",
          "add": "Add",
          "save": "Save Custom Tooltip Values",

          "toggleDebug.offLabel": "Enable Data Key Debugger",
          "toggleDebug.onLabel": "Disable Data Key Debugger"
        },
        "importExport": {
          "name": "Import / Export Tooltip Values",
          "label": "Import / Export",
          "hint": "Export Tooltip Values from one world and Import them to another (or share them with Illandril to help with debugging issues).",

          "title": "Illandril's Token Tooltips Import / Export",

          "instructions": {
            "bugs": "Click here to report bugs or request features",
            "notes": "This utility only imports or exports the Tooltip Values settings. Other tooltip settings (e.g. Persistent Tooltips, Simplify HP for Players, etc) are not included. Clicking Export will prompt you to download a `.json` file. Clicking Import will prompt you to select a previously downloaded `.json` file. Import may fail if you attempt to import settings exported from a different version of Illandril's Token Tooltips."
          },

          "import": "Import",
          "export": "Export",
          "close": "Close",
          "confirmImport": "Are you sure you want to overwrite your current Tooltip Values settings? WARNING: There is no \"undo\" - if you import to the wrong place, and don't have a valid saved export to restore from, you will need to manually restore your previous settings one by one from memory.",
          "error": "The selected file could not be read. Make sure you are using an export from a world that was using the same version of Illandril's Token Tooltips.",
          "success": "Tooltip Values have been imported. Consider clicking Configure Tooltip Values to confirm you imported the expected settings."
        },
        "persistentTooltips": {
          "name": "Persistent Tooltips",
          "label": "Configure Persistent Tooltips",
          "hint": "Configure Tooltips to always show in certain areas of the screen. Note: Unlike most other settings for this module, this is configurable per client instead of applying to everyone, allowing you to have persistent tooltips on a Tabletop Monitor for players to always see without cluttering up your GM screen.",

          "title": "Persistent Tooltip Configuration",

          "instructions": {
            "show": "Show Help",
            "hide": "Hide Help",
            "bugs": "Click here to report bugs or request features",
            "top": "Persistent Tooltips are visible whenever the associated Actor is visible on the current scene. If multiple tooltips are configured in the same location, they will be placed side-by-side. If a configured tooltip is not showing, verify that the ID is correct (check for extra whitespace before or after the ID), and make sure you have permission to see the tooltip by hovering over the token.",
            "type": "Actor looks up the token for the tooltip based on the Actor ID. User looks up the token for the tooltip based on the specified user's selected character (selected as their character via User Configuration, not token selection).",
            "id": "To get the ID for an Actor, open the actor's Actor Sheet and click on the book icon in the dialog title to copy the actor's ID.\nTo get the ID for a User, right-click on the user in the Players list and open the User Configuration dialog, then click the book icon in the dialog title to copy the user's ID.",
            "id_bad": "Indicates that the specified ID was invalid - double check the type and ID values.",
            "id_good": "Indicates that the specified ID was valid, but there is no associated token on the current scene. Hover over the icon to see the name of the associated User or Actor.",
            "id_best": "Indicates that the specified ID was valid, and there is an associated token on the current scene. Hover over the icon to see the name of the associated Token.",
            "rotation": "The rotation of the tooltip, in degrees (clockwise)."
          },

          "header": {
            "type": "Type",
            "id": "ID",
            "position": "Position",
            "rotation": "Rotation"
          },

          "positions": {
            "top": {
              "left": "Top Left",
              "center": "Top",
              "right": "Top Right"
            },
            "center": {
              "left": "Left",
              "center": "Center",
              "right": "Right"
            },
            "bottom": {
              "left": "Bottom Left",
              "center": "Bottom",
              "right": "Bottom Right"
            }
          },

          "rotations": {
            "0": "0째",
            "90": "90째",
            "180": "180째",
            "270": "270째"
          },

          "moveDown": "Move Down",
          "moveUp": "Move Up",
          "delete": "Delete",
          "deleteConfirm": "Are you sure you want to delete this value?",
          "add": "Add",
          "save": "Save Persistent Tooltips"
        }
      },
      "visibility": {
        "label": "Tooltip Visibility",
        "hint": "Tooltip Visibility adjusts which tokens show tooltips for players. Tooltips are shown for all tokens for GMs.",
        "choice": {
          "FRIENDLY": "Friendly Tokens (PC and NPC)",
          "NEUTRAL": "Neutral and Friendly Tokens (PC and NPC)",
          "ALL_PLAYERS": "Player Tokens (any disposition)",
          "OWNER": "Owned Actor Tokens",
          "OBSERVER": "Observed Actor Tokens",
          "LIMITED": "Limited Permission Actor Tokens",
          "ALL": "All Tokens",
          "NONE": "No Tokens (Show tooltips to GMs only)"
        }
      },
      "simplifyHP": {
        "label": "Simplify HP for Players",
        "hint": "Simplify the HP value shown to players (if HP is shown - Configure Tooltip Values above to configure when HP is visible at all). The unsimplified value is always shown to GMs.",
        "choice": {
          "NONE": "Don't simplify (Show the HP value)",
          "FOUR_HEARTS__PLAYERS_ALL": "Four Hearts (All Tokens)",
          "FOUR_HEARTS__PLAYERS_NON_FRIENDLY": "Four Hearts (Non-Friendly)",
          "FOUR_HEARTS__PLAYERS_HOSTILE": "Four Hearts (Hostile)",
          "FOUR_HEARTS__PLAYERS_NON_OBSERVER": "Four Hearts (Non-Observed)",
          "FIVE_HEARTS__PLAYERS_ALL": "Five Hearts (All Tokens)",
          "FIVE_HEARTS__PLAYERS_NON_FRIENDLY": "Five Hearts (Non-Friendly)",
          "FIVE_HEARTS__PLAYERS_HOSTILE": "Five Hearts (Hostile)",
          "FIVE_HEARTS__PLAYERS_NON_OBSERVER": "Five Hearts (Non-Observed)"
        }
      },
      "simplifyDamageTypes": {
        "label": "Res. / Imm. / Vuln. Style",
        "hint": "Specify how damage and condition type values for resistances, immunities, and vulnerabilities are shown. Not all types have icons - if a type does not have an icon, the name will be shown even if Icon is selected.",
        "choice": {
          "NONE": "Label (black)",
          "COLOR": "Label (color)",
          "ICON": "Icon (black)",
          "COLOR_ICON": "Icon (color)",
          "ICON_AND_TEXT": "Icon and Label (color)"
        }
      },
      "entityPermission.choice": {
        "NONE": "Show for Everyone",
        "LIMITED": "Limited or better",
        "OBSERVER": "Observer or better",
        "OWNER": "Owner or GM",
        "FRIENDLY": "Friendly (+GM)",
        "NEUTRAL": "Neutral or better (+GM)",
        "SHOW_TO_GMS_ONLY": "GM Only",
        "HIDE_FROM_EVERYONE": "Hide from Everyone"
      },
      "gmPermission.choice": {
        "ALL": "GM sees Player info",
        "NPC_ONLY": "NPC only for GMs"
      },
      "disableTooltips": {
        "label": "Disable Tooltips",
        "hint": "If checked, Tooltips will not show for you regardless of what other settings are configured by the GM for this module (client setting - does not impact other players). Note: Applies only to dynamic tooltips, and does not impact Persistent Tooltips, which you already can separately add or delete at will in the Configure Persistent Tooltips menu."
      },

      "rowsPerTooltip.label": "Tooltip Rows (Hover)",
      "rowsPerTooltip.hint": "The maximum number of rows shown in each column in the Tooltip.",

      "tooltipFontSize.label": "Tooltip Font Size (Hover)",
      "tooltipFontSize.hint": "The ratio of the font size of the Tooltips that show on hover, relative to the font size used in most other places in the application.",

      "rowsPerPersistent.label": "Persistent Tooltip Rows",
      "rowsPerPersistent.hint": "The maximum number of rows shown in each column in Persistent Tooltips.",

      "persistentFontSize.label": "Persistent Tooltip Font Size",
      "persistentFontSize.hint": "The ratio of the font size of Persistent Tooltips, relative to the font size used in most other places in the application.",

      "darkMode.label": "Dark Mode",
      "darkMode.hint": "If checked, the tooltip will show in a dark color scheme (as opposed to light).",

      "showOnLeft.label": "Show on Left",
      "showOnLeft.hint": "If checked, the tooltip will show on the left side of tokens (as opposed to the right side).",

      "showTokenName.label": "Show Token Name",
      "showTokenName.hint": "If checked, the tooltip will show on the Token's name at the top of the tooltip.",

      "showOnHighlightHotkey.label": "Show on Highlight Hotkey",
      "showOnHighlightHotkey.hint": "If checked, the tooltip will show (for the currently selected Token only) when you press the Highlight Objects hotkey (ALT by default; configurable in Configure Controls). Note: Not compatible with Show only with Tooltip Hotkey.",

      "showOnlyWithTooltipHotkey.label": "Show only with Tooltip Hotkey",
      "showOnlyWithTooltipHotkey.hint": "If checked, the tooltip will show only when the Show Tooltip Hotkey is pressed while hovering over a token (SHIFT by default; configurable in Configure Controls). Note: Not compatible with Show on Highlight Hotkey."
    },

    "debugDisplay.empty": "Hover over a token to see Data Keys for that actor",

    "hotkey": {
      "showTooltip": {
        "label": "Show Tooltip",
        "hint": "If \"Show only with Tooltip Hotkey\" is enabled, tooltips will only show when this button is pressed while hovering over a token."
      }
    },

    "pactAbbreviation": "P",
    "spellPointsAbbreviation": "P",
    "powerAbbreviation": "P",
    "cantripAbbreviation": "C",
    "focusAbbreviation": "F",

    "savingThrowFort": "Fort",
    "savingThrowRef": "Ref",
    "savingThrowWill": "Will",

    "touchACAbbreviation": "T",
    "flatFootedACAbbreviation": "FF",
    "cmdAbbreviation": "CMD",
    "meleeDefenseAbbreviation": "M.Def",
    "rangedDefenseAbbreviation": "R.Def",

    "tooltip": {
      "damageImmunities.label": "Immunities",
      "damageResistances.label": "Resistances",
      "damageVulnerabilities.label": "Vulnerabilities",
      "weaknesses.label": "Weaknesses",
      "conditionImmunities.label": "Cond. Imm."
    },

    "tooltipSwitch": "Show in Tooltip",
    "tooltipShown": "Shown in Tooltip",
    "tooltipNotShown": "Not Shown in Tooltip"
  }
}
